////11.1. Заполнить массив из восьми элементов

<?php 
	$arr=array ('37','0','50','46','34','46','0','13');
		foreach ($arr as $key => $value){
	 	echo $value.'<br/>';
	}
?>
////11.2. Заполнить массив из 10 элементов с клавиатуры (случайным образом)
	
	$arr=[];
	for ($i=0; $i<10; $i++){
		$arr[$i] = rand (0, 100);
	}
	var_dump ($arr);



////11.3 Заполнить массив из 15 элементов.
//вариант д

<?php
$arr = [];
for ($i=0; $i<=10; $i++) {
    $arr [$i] = rand (0, 10);
       }
print_r($arr);
?>

////11.4 массив предназначен для хранения значений роста

<?php
	$arr=[];
		for ($i=0; $i<12; $i++){
			$arr[$i]=rand (163, 190);
		}
	var_dump ($arr);	
?>

////11.5 массив предназначен для хранения значений веса

<?php
$arr=[];
for ($i=0; $i<20; $i++){
    $arr[$i]=rand (50, 100);
}
var_dump ($arr);
?>

////11.6 Заполнить массив из 12 элементов.

<?php
	$arr = array ();
		for ($i=1; $i<=12; $i++){
   		 for ($j=1; $j<=12; $j++){
        		$arr [$i][$j];
        $string = implode (",", $arr[$i][$j]);
    }
}
var_dump ($string);
?>

////11.7 Заполнить массив из 20 элементов.

<?php
	$arr = array ();
		for ($i=0; $i<20; $i++){
			for ($j=0; $j<20; $j++){
			$arr [$i][$j];
			$k=rsort ($arr);	
			$string = implode (", ", $arr);
			}
		}
	echo $string;
?>
11.215 Известно кол-во мячей. Найти общее кол0вл мячей.

<?php
$champ1=[];
$champ2=[];
for ($i=0; $i<2; $i++){
    for ($j=0; $j<26; $j++){
        $champ1 [$i][$j]= rand(1, 10);
        $champ2 [$i][$j]= rand(1, 10);
    }
}
echo "Кол-во мячей забытых в каждом чемпионате". '<br/>';
	   var_dump ($champ1, $champ2);
	$k=0;
	$m=0;
		for ($i=0; $i<2; $i++){
            for ($j=0; $j<26; $j++){
                $k=$k+$champ1[$i][$j];
                $m=$m+$champ2[$i][$j];
                $total=$k+$m;
            }
        }
 	echo "Кол-во мячей забытых в двух чемпионатах". '</br>';
    var_dump($total);
?>

//////
11.216 В области 20 районов. Определить среднюю урожайность пщеницы по каждому району и в целом
	Вариант 1. Без 3-го массива
<?php
	$squre=[];
	$amt=[];
		for ($i=0; $i<20; $i++){
			$squre [$i] = rand (1, 50);
			$amt [$i] = rand (1, 100);
			}
	echo "Средняя урожайность пшеницы по районам".'</tr>';
	var_dump ($amt);
	$s=0;
		for ($i=0; $i<20; $i++){
			$s = $s+$amt [$i]/$squre[$i];
			}
	    echo "Средняя урожайность пшеницы по области".'</tr>';
	    var_dump ($s);
?>

Вариант 2. c 3-v массивом

?php
	$squre=[];
	$amt=[];

	for ($i=0; $i<20; $i++){
  	  $squre [$i] = rand (1, 50);
   	  $amt [$i] = rand (1, 100);
}
echo "Средняя урожайность пшеницы по районам, ц/га:".'</tr>';
	var_dump ($amt);
		$squre_amt=[];
		for ($i=0; $i<20; $i++){
            $s = $s+$amt [$i]/$squre[$i];
            $squre_amt[]=[$s];
        }

	echo "Средняя урожайность пшеницы по области, ц/га:".'</tr>';
	var_dump ($squre_amt);
?>
//////11.218. РАзмеры 12 паралелепипедов
	Вариант 1. Без 3-го массива
<?php

$a=[];
$b=[];
$c=[];
for ($i=0; $i<12; $i++){
    for ($j=0; $j<12; $j++){
        $a[$i][$j] = rand (1,10);
        $b[$i][$j] = rand (1,10);
        $c[$i][$j] = rand (1,10);
    }
}
var_dump($a, $b, $c);
$k=0;
for ($i=0; $i<12; $i++){
    for ($j=0; $j<12; $j++){
        $k=$a[$i][$j]*$b[$i][$j]*$c[$i][$j];
    }
}
echo "объем каждой фигуры".$k.'<br/>';

?>
Вариант 2. c 3-м массивом
<?php
	$a=[];
	$b=[];
	$c=[];
		for ($i=0; $i<12; $i++){
			for ($j=0; $j<12; $j++){
			$a[$i][$j] = rand (1,10);
			$b[$i][$j] = rand (1,10);
			$c[$i][$j] = rand (1,10);
			}
		}
	var_dump($a, $b, $c);
	$m=[];
		for ($i=0; $i<12; $i++){
			for ($j=0; $j<12; $j++){
			$k=$a[$i][$j]*$b[$i][$j]*$c[$i][$j];
			$m[$i][$j]=$k;
			}
		}
	var_dump ($m);
?>



////11.221Определить словесный результат игры

	Вариант 1. Без 3-го массива
<?php
$win=[];
$lose=[];
for ($i=0;$i<15;$i++){
    for ($j=0;$j<15;$j++){
        $win[$i][$j] = rand (1, 100);
        $lose[$i][$j] = rand (1, 100);
    }
}
//var_dump ($win, $lose);
for ($j=0;$j<15;$j++){
    if ($win[$j]>$lose[$j]){
        echo "Выигрыш".'<br/>';}
    else {
        echo "Проигрыш".'<br/>';
        }
    }
?>

/////11.229. Определить в каком месяце выпало больше осадков

<?php
	$month1 = [];
	$month2 = [];
		for ($i=0; $i<2; $i++){
			for ($j=0; $j<31; $j++){
			$month1 [$i][$j] = rand (0, 50);
			$month2 [$i][$j] = rand (0, 50);
			}
		}
	$a = 0;
	$b = 0;
		for ($i=0; $i<2; $i++){
			for ($j=0; $j<31; $j++){
			$a = $a+$month1 [$i][$j];
			$b = $b+$month2 [$i][$j];
			}
		}
		if ($a > $b)
			echo "В январе выпало больше осадков";
		else 
			echo "В марте выпало больше осадков";
?>

/////11.230 Определить в каком из магазинов общий доход за месяц меньше
<?php
    $shop1 = [];
    $shop2 = [];
    for ($i=0; $i<28; $i++){
      $shop1 [$i] = rand (0, 1000);
      $shop2 [$i] = rand (0, 1000);
    {
    $sum1 = 0;
    $sum2 = 0;
        for ($i = 0; $i < 28; $i++) {
            $sum1 = $sum1 + $shop1[$i];
            $sum2 = $sum2 + $shop2[$i];
        }
            if ($sum1 > $sum2){
                echo "В магазине 2 общий доход меньше";
            } else {
                echo "В магазине 1 общий доход меньше";}

?>

//////10.2 Расчитать значение у, определив и использовав необходимую функцию:

Вариант А.
<?php
	function mean_y ($a, $b, $c){
		$d = $a+$b+$c;
	return $d;
	}
	$a=(1+sin(1))/3;
	$b=(5+sin(5))/3;
	$c=(3+sin(3))/3;
	$z= mean_y ($a, $b, $c);
	echo $z;
?>

Вариант б.

<?php
	function mean_y ($a,$b,$c){
		$d=$a+$b+$c;
	return $d;
	}
	$a=(2+sin(2))/(sin(5)+5);
	$b=(6+sin(6))/(sin(3)+3);
	$c=(1+sin(1))/(sin(4)+4);
	$z= mean_y ($a, $b, $c);
	echo $z;
?>

Вариант в.
<?php
	function mean_y ($a,$b,$c){
		$d=$a+$b+$c;
	return $d;
	}
	$a=(1+sin(4))/(4+sin(1));
	$b=(7+sin(5))/(5+sin(7));
	$c=(3+sin(2))/(2+sin(3));
	$z= mean_y ($a, $b, $c);
	echo $z;
?>
Вариант г.
<?php
	function mean_y ($a,$b,$c){
		$d=$a+$b+$c;
	return $d;
	}
	$a=(2+sin(3))/(3+sin(2));
	$b=(1+sin(5))/(sin(1)+5);
	$c=(sin(7)+4)/(sin(3)+7);
	$z= mean_y ($a, $b, $c);
	echo $z;
?>
/////10.7 Определить функцию для расчета периметра равнобедренной трапеции по ее основаниям и высоте.

<?php
	function square ($x, $y){
		$s= $xsqrt($y);
	return $s;
	}
	echo $s=square ($x, $y);
	$x= ($a+$b)/2;
	$y=$c**-($a-$b)**/4;
	$a=7;
	$b=5;
	$c=8;
?>